CommunityGD32Cores/pio-gd32-gdlinkcli/OptionBytesXML/GD32H7.xml
<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<OPBytesBlocks>
	<OPBytesBlock baseAddress="0x5200201C" length="60"/>
	<OPBytesBlock baseAddress="0x40022814" length="48" type="OTP"/>
</OPBytesBlocks>
<OPBytes baseAddress="0x5200201C" length="60">
	<OPByte>
		<name>FMC_OBSTAT0_EFT</name>
		<displayName>FMC_OBSTAT0_EFT</displayName>
		<addressOffset>0x00</addressOffset>
		<size>0x20</size>
		<access>read</access>
		<reset>0x01C6AAD0</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>IOSPDOPEN</name>
				<brief>Allowed enable status bit for I/O speed optimization at low-voltage</brief>
				<description>Allowed enable status bit for I/O speed optimization at low-voltage.&#x000A;0: Chip operating voltage greater than 2.5V, so I/O speed optimization is not allowed&#x000A;1: Chip operating voltage is less than 2.5V, so I/O speed optimization is allowed</description>
				<bitOffset>29</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>DTCM1ECCEN</name>
				<brief>DTCM1 ECC function enable status bit</brief>
				<description>DTCM1 ECC function enable status bit&#x000A;0: Disable CPU DTCM1 ECC function&#x000A;1: Enable CPU DTCM1 ECC function</description>
				<bitOffset>24</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>DTCM0ECCEN</name>
				<brief>DTCM0 ECC function enable status bit</brief>
				<description>DTCM0 ECC function enable status bit&#x000A;0: Disable CPU DTCM0 ECC function&#x000A;1: Enable CPU DTCM0 ECC function</description>
				<bitOffset>23</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>ITCMECCEN</name>
				<brief>ITCM ECC function enable status bit</brief>
				<description>ITCM ECC function enable status bit&#x000A;0: Disable CPU ITCM ECC function&#x000A;1: Enable CPU ITCM ECC function</description>
				<bitOffset>22</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>SCR</name>
				<brief>Secure mode status bit</brief>
				<description>Secure mode status bit&#x000A;0: Disable secure mode.&#x000A;1: Enable secure mode.</description>
				<bitOffset>21</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>FWDGSPD_STDBY</name>
				<brief>FWDGT suspend option in standby mode status bit</brief>
				<description>FWDGT suspend option in standby mode status bit&#x000A;0: FWDGT is suspend in system standby mode&#x000A;1: FWDGT is running in system standby mode.</description>
				<bitOffset>18</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>FWDGSPD_DPSLP</name>
				<brief>FWDGT suspend option in deepsleep mode status bit</brief>
				<description>FWDGT suspend option in deepsleep mode status bit&#x000A;0: FWDGT is suspend in system deepsleep mode&#x000A;1: FWDGT is running in system deepsleep mode.</description>
				<bitOffset>17</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>SPC[7:0]</name>
				<brief>Security protection level option byte status bits</brief>
				<description>Security protection level option byte status bits&#x000A;0xAA: No protection&#x000A;0xCC: Protection level high&#x000A;Any value except 0xAA or 0xCC: Protection level low.</description>
				<bitOffset>8</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
			<field>
				<name>nRST_STDBY</name>
				<brief>Option byte standby reset status bit</brief>
				<description>Option byte standby reset status bit&#x000A;0: Generates a reset instead of entering standby mode&#x000A;1: No reset when entering standby mode.</description>
				<bitOffset>7</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>nRST_DPSLP</name>
				<brief>Option byte deepsleep reset status bit</brief>
				<description>Option byte deepsleep reset status bit&#x000A;0: Generates a reset instead of entering Deep-sleep mode&#x000A;1: No reset when entering Deep-sleep mode</description>
				<bitOffset>6</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>nWDG_HW</name>
				<brief>Watchdog status bit</brief>
				<description>Watchdog status bit&#x000A;0: Hardware free watchdog&#x000A;1: Software free watchdog</description>
				<bitOffset>4</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>BOR_TH[1:0]</name>
				<brief>BOR threshold status bits</brief>
				<description>BOR threshold status bits&#x000A;00: No BOR function&#x000A;01: BOR threshold value 1&#x000A;10: BOR threshold value 2&#x000A;11: BOR threshold value 3</description>
				<bitOffset>2</bitOffset>
				<bitWidth>2</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>FMC_OBSTAT0_MDF</name>
		<displayName>FMC_OBSTAT0_MDF</displayName>
		<addressOffset>0x04</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<reset>0x01C6AAD0</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>IOSPDOPEN</name>
				<brief>Allowed enable configuration bit for I/O speed optimization at low-voltage</brief>
				<description>Allowed enable configuration bit for I/O speed optimization at low-voltage.&#x000A;0: Chip operating voltage greater than 2.5V, so I/O speed optimization is not allowed&#x000A;1: Chip operating voltage is less than 2.5V, so I/O speed optimization is allowed</description>
				<bitOffset>29</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>DTCM1ECCEN</name>
				<brief>DTCM1 ECC function enable configuration bit</brief>
				<description>DTCM1 ECC function enable configuration bit&#x000A;0: Disabled CPU DTCM1 ECC function&#x000A;1: Enabled CPU DTCM1 ECC function</description>
				<bitOffset>24</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>DTCM0ECCEN</name>
				<brief>DTCM0 ECC function enable configuration bit</brief>
				<description>DTCM0 ECC function enable configuration bit&#x000A;0: Disabled CPU DTCM0 ECC function&#x000A;1: enabled CPU DTCM0 ECC function</description>
				<bitOffset>23</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>ITCMECCEN</name>
				<brief>ITCM ECC function enable configuration bit</brief>
				<description>ITCM ECC function enable configuration bit&#x000A;0: disabled CPU ITCM ECC function&#x000A;1: enabled CPU ITCM ECC function</description>
				<bitOffset>22</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>SCR</name>
				<brief>Secure mode configuration bit</brief>
				<description>Secure mode configuration bit&#x000A;0: Disable secure mode.&#x000A;1: Enable secure mode.</description>
				<bitOffset>21</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>FWDGSPD_STDBY</name>
				<brief>FWDGT suspend option in standby mode configuration bit</brief>
				<description>FWDGT suspend option in standby mode configuration bit&#x000A;0: FWDGT is suspend in system standby mode&#x000A;1: FWDGT is running in system standby mode.</description>
				<bitOffset>18</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>FWDGSPD_DPSLP</name>
				<brief>FWDGT suspend option in deepsleep mode configuration bit</brief>
				<description>FWDGT suspend option in deepsleep mode configuration bit&#x000A;0: FWDGT is suspend in system deepsleep mode&#x000A;1: FWDGT is running in system deepsleep mode.</description>
				<bitOffset>17</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>SPC[7:0]</name>
				<brief>Security protection level option configuration bits</brief>
				<description>Security protection level option configuration bits&#x000A;0xAA: No protection&#x000A;0xCC: Protection level high&#x000A;Any value except 0xAA or 0xCC: Protection level low.</description>
				<bitOffset>8</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
			<field>
				<name>nRST_STDBY</name>
				<brief>Option byte standby reset configuration bit</brief>
				<description>Option byte standby reset configuration bit&#x000A;0: Generates a reset instead of entering standby mode&#x000A;1: No reset when entering standby mode</description>
				<bitOffset>7</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>nRST_DPSLP</name>
				<brief>Option byte deepsleep reset configuration bit</brief>
				<description>Option byte deepsleep reset configuration bit&#x000A;0: Generates a reset instead of entering deep-sleep mode&#x000A;1: No reset when entering deep-sleep mode</description>
				<bitOffset>6</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>nWDG_HW</name>
				<brief>Watchdog configuration bit</brief>
				<description>Watchdog configuration bit&#x000A;0: Hardware free watchdog&#x000A;1: Software free watchdog</description>
				<bitOffset>4</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>BOR_TH[1:0]</name>
				<brief>BOR threshold configuration bits</brief>
				<description>BOR threshold configuration bits&#x000A;00: No BOR function&#x000A;01: BOR threshold value 1&#x000A;10: BOR threshold value 2&#x000A;11: BOR threshold value 3</description>
				<bitOffset>2</bitOffset>
				<bitWidth>2</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>FMC_DCRPADDR_EFT</name>
		<displayName>FMC_DCRPADDR_EFT</displayName>
		<addressOffset>0x0C</addressOffset>
		<size>0x20</size>
		<access>read</access>
		<reset>0x000000FF</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>DCRP_EREN</name>
				<brief>DCRP area erase enable status bit</brief>
				<description>DCRP area erase enable status bit.&#x000A;0: DCRP is not erased.&#x000A;1: DCRP is erased when a SPC level low to no protection demotion or a protection-removed mass erase occur.</description>
				<bitOffset>31</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>DCRP_AREA_END[10:0]</name>
				<brief>DCRP area end address status bits</brief>
				<description>DCRP area end address status bits&#x000A;These bits contain the last 4K-byte block of the DCRP area.&#x000A;End absolute address = ( DCRP_AREA_END[10:0] + 1 ) * 4096 - 1 + 0x0800_0000.&#x000A;If DCRP_AREA_END[10:0] = DCRP_AREA_START[10:0], DCRP protects the whole main flash block.&#x000A;If DCRP_AREA_END[10:0] &lt; DCRP_AREA_START[10:0], protection is invalid.</description>
				<bitOffset>16</bitOffset>
				<bitWidth>11</bitWidth>
			</field>
			<field>
				<name>DCRP_AREA_START[10:0]</name>
				<brief>DCRP area start address status bits</brief>
				<description>DCRP area start address status bits&#x000A;These bits contain the first 4K-byte block of the DCRP area.&#x000A;Start absolute address = DCRP_AREA_START[10:0] * 4096 + 0x0800_0000.&#x000A;If DCRP_AREA_END[10:0] = DCRP_AREA_START[10:0], DCRP protects the whole main flash block.&#x000A;If DCRP_AREA_END[10:0] &lt; DCRP_AREA_START[10:0], protection is invalid.</description>
				<bitOffset>0</bitOffset>
				<bitWidth>11</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>FMC_DCRPADDR_MDF</name>
		<displayName>FMC_DCRPADDR_MDF</displayName>
		<addressOffset>0x10</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<reset>0x000000FF</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>DCRP_EREN</name>
				<brief>DCRP area erase enable configuration bit</brief>
				<description>DCRP area erase enable configuration bit.&#x000A;0: DCRP is not erased.&#x000A;1: DCRP is erased when a SPC level low to no protection demotion or a protection-removed mass erase.</description>
				<bitOffset>31</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>DCRP_AREA_END[10:0]</name>
				<brief>DCRP area end address configuration bits</brief>
				<description>DCRP area end address configuration bits&#x000A;These bits contain the last 4K-byte block of the DCRP area.&#x000A;End absolute address = ( DCRP_AREA_END[10:0] + 1 ) * 4096 - 1 + 0x0800_0000&#x000A;If DCRP_AREA_END[10:0] = DCRP_AREA_START[10:0], DCRP protects the whole main flash block.&#x000A;If DCRP_AREA_END[10:0] &lt; DCRP_AREA_START[10:0], protection is invalid.</description>
				<bitOffset>16</bitOffset>
				<bitWidth>11</bitWidth>
			</field>
			<field>
				<name>DCRP_AREA_START[10:0]</name>
				<brief>DCRP area start address configuration bits</brief>
				<description>DCRP area start address configuration bits&#x000A;These bits contain the first 4K-byte block of the DCRP area.&#x000A;Start absolute address = DCRP_AREA_START[10:0] * 4096 + 0x0800_0000.&#x000A;If DCRP_AREA_END[10:0] = DCRP_AREA_START[10:0], DCRP protects the whole main flash block.&#x000A;If DCRP_AREA_END[10:0] &lt; DCRP_AREA_START[10:0], protection is invalid.</description>
				<bitOffset>0</bitOffset>
				<bitWidth>11</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>FMC_SCRADDR_EFT</name>
		<displayName>FMC_SCRADDR_EFT</displayName>
		<addressOffset>0x14</addressOffset>
		<size>0x20</size>
		<access>read</access>
		<reset>0x000000FF</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>SCR_EREN</name>
				<brief>Secure user area erase enable option status bit</brief>
				<description>Secure user area erase enable option status bit.&#x000A;0: No action&#x000A;1: The secure user area is erased when a SPC level low to no protection demotion or a protection-removed mass erase.</description>
				<bitOffset>31</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>SCR_AREA_END[10:0]</name>
				<brief>Secure user area end address status bits</brief>
				<description>Secure user area end address status bits&#x000A;These bits contain the last 4K-byte block of the secure user area.&#x000A;End absolute address = (SCR_AREA_END[10:0] + 1 ) * 4096 - 1 + 0x0800_0000&#x000A;If SCR_AREA_END[10:0] = SCR_AREA_START[10:0], whole main flash block is secure user area.&#x000A;If SCR_AREA_END[10:0] &lt; SCR_AREA_START[10:0], protection is invalid.</description>
				<bitOffset>16</bitOffset>
				<bitWidth>11</bitWidth>
			</field>
			<field>
				<name>SCR_AREA_START[10:0]</name>
				<brief>Secure user area start address status bits</brief>
				<description>Secure user area start address status bits&#x000A;These bits contain the first 4K-byte block of the secure user area.&#x000A;Start absolute address = SCR_AREA_START[10:0] * 4096 + 0x0800_0000.&#x000A;If SCR_AREA_END[10:0] = SCR_AREA_START[10:0], whole main flash block is secure user area.&#x000A;If SCR_AREA_END[10:0] &lt; SCR_AREA_START[10:0], protection is invalid.</description>
				<bitOffset>0</bitOffset>
				<bitWidth>11</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>FMC_SCRADDR_MDF</name>
		<displayName>FMC_SCRADDR_MDF</displayName>
		<addressOffset>0x18</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		<reset>0x000000FF</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>SCR_EREN</name>
				<brief>Secure user area erase enable option configuration bit</brief>
				<description>Secure user area erase enable option configuration bit.&#x000A;0: No action&#x000A;1: The secure user area is erased when a SPC level low to no protection demotion or a protection-removed mass erase.</description>
				<bitOffset>31</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>SCR_AREA_END[10:0]</name>
				<brief>Secure user area end address configuration bits</brief>
				<description>Secure user area end address configuration bits&#x000A;These bits contain the last 4K-byte block of the secure user area.&#x000A;End absolute address = (SCR_AREA_END[10:0] + 1 ) * 4096 - 1 + 0x0800_0000&#x000A;If SCR_AREA_END[10:0] = SCR_AREA_START[10:0], whole main flash block is secure user.&#x000A;If SCR_AREA_END[10:0] &lt; SCR_AREA_START[10:0], protection is invalid.</description>
				<bitOffset>16</bitOffset>
				<bitWidth>11</bitWidth>
			</field>
			<field>
				<name>SCR_AREA_START[10:0]</name>
				<brief>Secure user area start address configuration bits</brief>
				<description>Secure user area start address configuration bits&#x000A;These bits contain the first 4K-byte block of the secure user area.&#x000A;Start absolute address = SCR_AREA_START[10:0] * 4096 + 0x0800_0000.&#x000A;If SCR_AREA_END[10:0] = SCR_AREA_START[10:0], whole main flash block is secure user.&#x000A;If SCR_AREA_END[10:0] &lt; SCR_AREA_START[10:0], protection is invalid.</description>
				<bitOffset>0</bitOffset>
				<bitWidth>11</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>FMC_WP_EFT</name>
		<displayName>FMC_WP_EFT</displayName>
		<addressOffset>0x1C</addressOffset>
		<size>0x20</size>
		<access>read</access>
		<reset>0x3FFFFF</reset>
		<complement>FFFF</complement>
		<fields>
		<field>
			<name>WP[29]</name>
			<brief>0x8780000~0x87BFFFF</brief>
			<description>WP[29] bit reflects the corresponding 64 sectors to erase/program protection status.&#x000A;0: corresponding 64 sectors are erase/program protected&#x000A;1: corresponding 64 sectors are not erase/program protected</description>
			<bitOffset>29</bitOffset>
			<bitWidth>1</bitWidth>
		</field>
		<field>
			<name>WP[28]</name>
			<brief>0x8700000~0x877FFFF</brief>
			<description>each bit reflects the corresponding 128 sectors to erase/program protection status.&#x000A;0: corresponding 128 sectors are erase/program protected.&#x000A;1: corresponding 128 sectors are not erase/program protected</description>
			<bitOffset>28</bitOffset>
			<bitWidth>1</bitWidth>
		</field>
		<field>
			<name>WP[27]</name>
			<brief>0x8680000~0x86FFFFF</brief>
			<description>each bit reflects the corresponding 128 sectors to erase/program protection status.&#x000A;0: corresponding 128 sectors are erase/program protected.&#x000A;1: corresponding 128 sectors are not erase/program protected</description>
			<bitOffset>27</bitOffset>
			<bitWidth>1</bitWidth>
		</field>
		<field>
			<name>WP[26]</name>
			<brief>0x8600000~0x867FFFF</brief>
			<description>each bit reflects the corresponding 128 sectors to erase/program protection status.&#x000A;0: corresponding 128 sectors are erase/program protected.&#x000A;1: corresponding 128 sectors are not erase/program protected</description>
			<bitOffset>26</bitOffset>
			<bitWidth>1</bitWidth>
		</field>
		<field>
			<name>WP[25]</name>
			<brief>0x8580000~0x85FFFFF</brief>
			<description>each bit reflects the corresponding 128 sectors to erase/program protection status.&#x000A;0: corresponding 128 sectors are erase/program protected.&#x000A;1: corresponding 128 sectors are not erase/program protected</description>
			<bitOffset>25</bitOffset>
			<bitWidth>1</bitWidth>
		</field>
		<field>
			<name>WP[24]</name>
			<brief>0x8500000~0x857FFFF</brief>
			<description>each bit reflects the corresponding 128 sectors to erase/program protection status.&#x000A;0: corresponding 128 sectors are erase/program protected.&#x000A;1: corresponding 128 sectors are not erase/program protected</description>
			<bitOffset>24</bitOffset>
			<bitWidth>1</bitWidth>
		</field>
		<field>
			<name>WP[23]</name>
			<brief>0x8480000~0x84FFFFF</brief>
			<description>each bit reflects the corresponding 128 sectors to erase/program protection status.&#x000A;0: corresponding 128 sectors are erase/program protected.&#x000A;1: corresponding 128 sectors are not erase/program protected</description>
			<bitOffset>23</bitOffset>
			<bitWidth>1</bitWidth>
		</field>
		<field>
			<name>WP[22]</name>
			<brief>0x8400000~0x847FFFF</brief>
			<description>each bit reflects the corresponding 128 sectors to erase/program protection status.&#x000A;0: corresponding 128 sectors are erase/program protected.&#x000A;1: corresponding 128 sectors are not erase/program protected</description>
			<bitOffset>22</bitOffset>
			<bitWidth>1</bitWidth>
		</field>
		<field>
			<name>WP[21]</name>
			<brief>0x8380000~0x83FFFFF</brief>
			<description>each bit reflects the corresponding 128 sectors to erase/program protection status.&#x000A;0: corresponding 128 sectors are erase/program protected.&#x000A;1: corresponding 128 sectors are not erase/program protected</description>
			<bitOffset>21</bitOffset>
			<bitWidth>1</bitWidth>
		</field>
		<field>
			<name>WP[20]</name>
			<brief>0x8300000~0x837FFFF</brief>
			<description>each bit reflects the corresponding 128 sectors to erase/program protection status.&#x000A;0: corresponding 128 sectors are erase/program protected.&#x000A;1: corresponding 128 sectors are not erase/program protected</description>
			<bitOffset>20</bitOffset>
			<bitWidth>1</bitWidth>
		</field>
		<field>
			<name>WP[19]</name>
			<brief>0x8280000~0x82FFFFF</brief>
			<description>each bit reflects the corresponding 128 sectors to erase/program protection status.&#x000A;0: corresponding 128 sectors are erase/program protected.&#x000A;1: corresponding 128 sectors are not erase/program protected</description>
			<bitOffset>19</bitOffset>
			<bitWidth>1</bitWidth>
		</field>
		<field>
			<name>WP[18]</name>
			<brief>0x8200000~0x827FFFF</brief>
			<description>each bit reflects the corresponding 128 sectors to erase/program protection status.&#x000A;0: corresponding 128 sectors are erase/program protected.&#x000A;1: corresponding 128 sectors are not erase/program protected</description>
			<bitOffset>18</bitOffset>
			<bitWidth>1</bitWidth>
		</field>
		<field>
			<name>WP[17]</name>
			<brief>0x8180000~0x81FFFFF</brief>
			<description>each bit reflects the corresponding 128 sectors to erase/program protection status.&#x000A;0: corresponding 128 sectors are erase/program protected.&#x000A;1: corresponding 128 sectors are not erase/program protected</description>
			<bitOffset>17</bitOffset>
			<bitWidth>1</bitWidth>
		</field>
		<field>
			<name>WP[16]</name>
			<brief>0x8100000~0x817FFFF</brief>
			<description>each bit reflects the corresponding 128 sectors to erase/program protection status.&#x000A;0: corresponding 128 sectors are erase/program protected.&#x000A;1: corresponding 128 sectors are not erase/program protected</description>
			<bitOffset>16</bitOffset>
			<bitWidth>1</bitWidth>
		</field>
		<field>
			<name>WP[15]</name>
			<brief>0x80F0000~0x80FFFFF</brief>
			<description>each bit reflects the corresponding 16 sectors to erase/program protection status.&#x000A;0: corresponding 16 sectors are erase/program protected.&#x000A;1: corresponding 16 sectors are not erase/program protected</description>
			<bitOffset>15</bitOffset>
			<bitWidth>1</bitWidth>
		</field>
		<field>
			<name>WP[14]</name>
			<brief>0x80E0000~0x80EFFFF</brief>
			<description>each bit reflects the corresponding 16 sectors to erase/program protection status.&#x000A;0: corresponding 16 sectors are erase/program protected.&#x000A;1: corresponding 16 sectors are not erase/program protected</description>
			<bitOffset>14</bitOffset>
			<bitWidth>1</bitWidth>
		</field>
		<field>
			<name>WP[13]</name>
			<brief>0x80D0000~0x80DFFFF</brief>
			<description>each bit reflects the corresponding 16 sectors to erase/program protection status.&#x000A;0: corresponding 16 sectors are erase/program protected.&#x000A;1: corresponding 16 sectors are not erase/program protected</description>
			<bitOffset>13</bitOffset>
			<bitWidth>1</bitWidth>
		</field>
		<field>
			<name>WP[12]</name>
			<brief>0x80C0000~0x80CFFFF</brief>
			<description>each bit reflects the corresponding 16 sectors to erase/program protection status.&#x000A;0: corresponding 16 sectors are erase/program protected.&#x000A;1: corresponding 16 sectors are not erase/program protected</description>
			<bitOffset>12</bitOffset>
			<bitWidth>1</bitWidth>
		</field>
		<field>
			<name>WP[11]</name>
			<brief>0x80B0000~0x80BFFFF</brief>
			<description>each bit reflects the corresponding 16 sectors to erase/program protection status.&#x000A;0: corresponding 16 sectors are erase/program protected.&#x000A;1: corresponding 16 sectors are not erase/program protected</description>
			<bitOffset>11</bitOffset>
			<bitWidth>1</bitWidth>
		</field>
		<field>
			<name>WP[10]</name>
			<brief>0x80A0000~0x80AFFFF</brief>
