CommunityGD32Cores/pio-gd32-gdlinkcli/OptionBytesXML/GD32H7.xml
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>SCR_AREA_END[7:0]</name>
				<brief>Secure user area end address bits</brief>
				<description>Secure user area end address bits&#x000A;These bits contain the last 32K-byte block of the secure user area.&#x000A;The secure user area can be defined by efuse with a granularity of 32 Kbytes.&#x000A;End absolute address = ( SCR_AREA_END[7:0] + 1) * 32768 - 1 + 0x0800_0000.&#x000A;If SCR_AREA_END[7:0] = SCR_AREA_START[7:0] = 0 , the secure user area is undefined.&#x000A;If SCR_AREA_END[7:0] = SCR_AREA_START[7:0] &gt; 0 , whole main flash block is secure user.&#x000A;If SCR_AREA_END[7:0] &lt; SCR_AREA_START[7:0], secure user area is invalid.&#x000A;Refer to Table 36. Secure user area configuration for more details.</description>
				<bitOffset>24</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
			<field>
				<name>SCR_AREA_START[7:0]</name>
				<brief>Secure user area start address bits</brief>
				<description>Secure user area start address bits&#x000A;These bits contain the first 32K-byte block of the secure user area.&#x000A;The secure user area can be defined by efuse with a granularity of 32 Kbytes.&#x000A;Start absolute address = SCR_AREA_START[7:0] * 32768 + 0x0800_0000.&#x000A;If SCR_AREA_END[7:0] = SCR_AREA_START[7:0] = 0 , the secure user area is undefined.&#x000A;If SCR_AREA_END[7:0] = SCR_AREA_START[7:0] &gt; 0, whole main flash block is secure user.&#x000A;If SCR_AREA_END[7:0] &lt; SCR_AREA_START[7:0], secure user area is invalid.&#x000A;Refer to Table 36. Secure user area configuration for more details.</description>
				<bitOffset>16</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
			<field>
				<name>SCR</name>
				<brief>Secure mode enable</brief>
				<description>Secure mode enable&#x000A;0: Disable secure mode.&#x000A;1: Enable secure mode.</description>
				<bitOffset>13</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>SPC_H</name>
				<brief>Configure security protection to level high</brief>
				<description>Configure security protection to level high&#x000A;Refer to Table 34. SPC protection level configuration for more details.</description>
				<bitOffset>12</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>SPC_L</name>
				<brief>Configure security protection to level low</brief>
				<description>Configure security protection to level low&#x000A;Refer to Table 34. SPC protection level configuration for more details.</description>
				<bitOffset>11</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>JTAGNSW</name>
				<brief>SW or JTAG debugger select</brief>
				<description>SW or JTAG debugger select&#x000A;0: SW&#x000A;1: JTAG</description>
				<bitOffset>10</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>NDBG[1:0]</name>
				<brief>Debugging permission setting</brief>
				<description>Debugging permission setting&#x000A;00: Normal JTAG ( only valid when JTAGNSW bit is 1, otherwise SW debugger is selected )&#x000A;01: Secure JTAG ( only valid when JTAGNSW bit is 1, otherwise SW debugger is selected )&#x000A;10~11: No debug ( debug function is closed regardless of the JTAGNSW bit )</description>
				<bitOffset>8</bitOffset>
				<bitWidth>2</bitWidth>
			</field>
			<field>
				<name>UDLK</name>
				<brief>EFUSE_USER_DATAx register lock bit</brief>
				<description>EFUSE_USER_DATAx register lock bit &#x000A;0: Unlock EFUSE_USER_DATAx register, the register can be modified.&#x000A;1: Lock EFUSE_USER_DATAx register, the register can not be modified.</description>
				<bitOffset>4</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>AESEN</name>
				<brief>Lock EFUSE_AES_KEYx register and enable AES decrypt function</brief>
				<description>Lock EFUSE_AES_KEYx register and enable AES decrypt function &#x000A;0: Disable AES decrypt and AES key can be written &#x000A;1: Enable AES decrypt and AES key canot be written</description>
				<bitOffset>3</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>UCLK</name>
				<brief>Low 16 bits of EFUSE_USER_CTL register lock bit</brief>
				<description>Low 16 bits of EFUSE_USER_CTL register lock bit&#x000A;0: Unlock the low 16 bits of EFUSE_USER_CTL register, the bits can be modified&#x000A;1: Lock the low 16 bits of EFUSE_USER_CTL register, the bits can not be modified&#x000A;If the UCLK bit is 1, other lock bits in EFUSE_USER_CTL register cannot be modified, so user should be careful when set UCLK bit.</description>
				<bitOffset>2</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>SCRLK</name>
				<brief>Secure userarea address lock bit</brief>
				<description>Secure userarea address lock bit&#x000A;0: Unlock the high 16 bits in EFUSE_USER_CTL register, the bits can be modified.&#x000A;1: Lock the high 16 bits in EFUSE_USER_CTL register, the bits can not be modified.</description>
				<bitOffset>1</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>DPLK</name>
				<brief>EFUSE_DPx register lock bit</brief>
				<description>EFUSE_DPx register lock bit. &#x000A;0: Unlock EFUSE_DPx register, the register can be written or read.&#x000A;1: Lock EFUSE_DPx register, the register can not be written. When this bit is 1, the JTAGNSW bit is 1, and the NDBG[1:0] bits are 2b'01 or 2b'11, the register can not be read. Otherwise this register can be read.</description>
				<bitOffset>0</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>EFUSE_MCU_RSV</name>
		<displayName>EFUSE_MCU_RSV</displayName>
		<addressOffset>0x04</addressOffset>
		<size>0x20</size>
		<access>read-write</access>
		
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>DCRP_AREA_END[7:0]</name>
				<brief>DCRP area end address bits</brief>
				<description>DCRP area end address bits&#x000A;These bits contain the last 32K-byte block of the DCRP area.&#x000A;The DCRP area can be defined by efuse with a granularity of 32 Kbytes.&#x000A;End absolute address = (DCRP_AREA_END[7:0] + 1) * 32768 - 1 + 0x0800_0000.&#x000A;If DCRP_AREA_END[7:0] = DCRP_AREA_START[7:0] = 0, DCRP area is undefined.&#x000A;If DCRP_AREA_END[7:0] = DCRP_AREA_START[7:0] &gt; 0, whole main flash block is DCRP area.&#x000A;If DCRP_AREA_END[7:0] &lt; DCRP_AREA_START[7:0], DCRP area is invalid.&#x000A;Refer to Table 35. DCRP area configuration for more details.</description>
				<bitOffset>24</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
			<field>
				<name>DCRP_AREA_START[7:0]</name>
				<brief>DCRP area start address bits</brief>
				<description>DCRP area start address bits&#x000A;These bits contain the first 32K-byte block of the DCRP area.&#x000A;The DCRP area can be defined by efuse with a granularity of 32 Kbytes.&#x000A;Start absolute address = DCRP_AREA_START[7:0] * 32768 + 0x0800_0000.&#x000A;If DCRP_AREA_END[7:0] = DCRP_AREA_START[7:0] = 0, DCRP area is undefined.&#x000A;If DCRP_AREA_END[7:0] = DCRP_AREA_START[7:0] &gt; 0, whole main flash block is DCRP area.&#x000A;If DCRP_AREA_END[7:0] &lt; DCRP_AREA_START[7:0], DCRP area is invalid.&#x000A;Refer to Table 35. DCRP area configuration for more details.</description>
				<bitOffset>16</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
			<field>
				<name>MCU_RSV[5:0]</name>
				<brief>MCU reserved data</brief>
				<description>MCU reserved data</description>
				<bitOffset>10</bitOffset>
				<bitWidth>6</bitWidth>
			</field>
			<field>
				<name>DCRPLK</name>
				<brief>DCRP area address lock bit</brief>
				<description>DCRP area address lock bit&#x000A;0: Unlock the high 16 bits in EFUSE_MCU_RSV register, the bits can be modified.&#x000A;1: Lock the high 16 bits in EFUSE_MCU_RSV register, the bits can not be modified.</description>
				<bitOffset>9</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>MCURSVLK</name>
				<brief>Low 16 bits of EFUSE_MCU_RSV register lock bit</brief>
				<description>Low 16 bits of EFUSE_MCU_RSV register lock bit&#x000A;0: Unlock the low 16 bits of EFUSE_MCU_RSV register, the bits can be modified&#x000A;1: Lock the low 16 bits of EFUSE_MCU_RSV register, the bits can not be modified&#x000A;If the MCURSVLK bit is 1, other lock bits in EFUSE_MCU_RSV register cannot be modified, so user should be careful when set MCURSVLK bit.</description>
				<bitOffset>8</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>VFIMG</name>
				<brief>Firmware image verification enable bit</brief>
				<description>Firmware image verification enable bit&#x000A;0: Disable firmware image verification&#x000A;1: Enable firmware image verification</description>
				<bitOffset>7</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>DISLFI</name>
				<brief>Licensed firmware install ( LFI ) disable</brief>
				<description>Licensed firmware install ( LFI ) disable&#x000A;0: Enable licensed firmware install&#x000A;1: Disable licensed firmware install</description>
				<bitOffset>6</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>AESNCAU</name>
				<brief>AES key for cau configuration bit</brief>
				<description>AES key for cau configuration bit&#x000A;0: The AES key can be used for CAU&#x000A;1: The AES key cannot be used for CAU</description>
				<bitOffset>0</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
		</fields>
	</OPByte>
<OPByte>
	<name>EFUSE_DP0</name>
	<displayName>EFUSE_DP0</displayName>
	<addressOffset>0x08</addressOffset>
	<size>0x20</size>
	<access>read-write</access>
	<complement>FFFF</complement>
	<fields>
		<field>
			<name>DP0[31:0]</name>
			<brief>Efuse debug password value</brief>
			<description>Efuse debug password value</description>
			<bitOffset>0</bitOffset>
			<bitWidth>32</bitWidth>
		</field>
	</fields>
</OPByte>
<OPByte>
	<name>EFUSE_DP1</name>
	<displayName>EFUSE_DP1</displayName>
	<addressOffset>0x0C</addressOffset>
	<size>0x20</size>
	<access>read-write</access>
	<complement>FFFF</complement>
	<fields>
		<field>
			<name>DP1[31:0]</name>
			<brief>Efuse debug password value</brief>
			<description>Efuse debug password value</description>
			<bitOffset>0</bitOffset>
			<bitWidth>32</bitWidth>
		</field>
	</fields>
</OPByte>
<OPByte>
	<name>USERDATA0</name>
	<displayName>USERDATA0</displayName>
	<addressOffset>0x20</addressOffset>
	<size>0x20</size>
	<access>read-write</access>
	<complement>FFFF</complement>
	<fields>
		<field>
			<name>USERDATA0[31:0]</name>
			<brief>Efuse USER_DATA0 value</brief>
			<description>Efuse USER_DATA0 value</description>
			<bitOffset>0</bitOffset>
			<bitWidth>32</bitWidth>
		</field>
	</fields>
</OPByte>
<OPByte>
	<name>USERDATA1</name>
	<displayName>USERDATA1</displayName>
	<addressOffset>0x24</addressOffset>
	<size>0x20</size>
	<access>read-write</access>
	<complement>FFFF</complement>
	<fields>
		<field>
			<name>USERDATA1[31:0]</name>
			<brief>Efuse USER_DATA1 value</brief>
			<description>Efuse USER_DATA1 value</description>
			<bitOffset>0</bitOffset>
			<bitWidth>32</bitWidth>
		</field>
	</fields>
</OPByte>
<OPByte>
	<name>USERDATA2</name>
	<displayName>USERDATA2</displayName>
	<addressOffset>0x28</addressOffset>
	<size>0x20</size>
	<access>read-write</access>
	<complement>FFFF</complement>
	<fields>
		<field>
			<name>USERDATA2[31:0]</name>
			<brief>Efuse USER_DATA2 value</brief>
			<description>Efuse USER_DATA2 value</description>
			<bitOffset>0</bitOffset>
			<bitWidth>32</bitWidth>
		</field>
	</fields>
</OPByte>
<OPByte>
	<name>USERDATA3</name>
	<displayName>USERDATA3</displayName>
	<addressOffset>0x2C</addressOffset>
	<size>0x20</size>
	<access>read-write</access>
	<complement>FFFF</complement>
	<fields>
		<field>
			<name>USERDATA3[31:0]</name>
			<brief>Efuse USER_DATA3 value</brief>
			<description>Efuse USER_DATA3 value</description>
			<bitOffset>0</bitOffset>
			<bitWidth>32</bitWidth>
		</field>
	</fields>
</OPByte>
</OPBytes>
